wjw890912/si4432-m051/M051_SI4432_RELAY/Lib/DrvADC.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2009 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------------------------------------*/
/* Include related headers                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
#include "M051Series.h"
#include "core_cm0.h"
#include "DrvADC.h"
#include "DrvSYS.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static DRVADC_ADC_CALLBACK *g_ptADCCallBack;
static DRVADC_ADCMP0_CALLBACK *g_ptADCMP0CallBack;
static DRVADC_ADCMP1_CALLBACK *g_ptADCMP1CallBack;
static uint32_t g_pu32UserData[3];

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_Open                                                                                   */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*   InputMode    [in]:  Specify the type of the analog input signal.                                      */
/*                       It might be single-end (ADC_SINGLE_END) or differential input (ADC_DIFFERENTIAL). */
/*   OpMode       [in]:  Specify the operation mode.                                                       */
/*                       It might be single, burst, single cycle scan or continuous scan mode.             */
/*                       (ADC_SINGLE_OP / ADC_BURST_OP / ADC_SINGLE_CYCLE_OP / ADC_CONTINUOUS_OP)          */
/*   u8ChannelSelBitwise [in]:  Specify the input channels.                                                */
/*                              For example, "u8ChannelSelBitwise=0x1(00000001b)" means the ADC channel 0  */
/*                              is enabled; "u8ChannelSelBitwise=0x19(00011001b)" means the ADC channel 0, */
/*                              3 and 4 are enabled.                                                       */
/*   ClockSrc     [in]:  Specify the clock source of ADC clock.                                            */
/*                       It could be EXTERNAL_12MHZ / INTERNAL_PLL / INTERNAL_RC22MHZ.                     */
/*   u8AdcDivisor [in]:  Determine the ADC clock frequency. It could be 0~255.                             */
/*                       ADC clock frequency = ADC clock source frequency / ( u8AdcDivisor + 1 )           */
/*                                                                                                         */
/* Returns:                                                                                                */
/*   None.                                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*   Enable the ADC function. Configure the corresponding pins of the specified channels as analog input   */
/*   pins.                                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_Open(E_ADC_INPUT_MODE InputMode, E_ADC_OPERATION_MODE OpMode, uint8_t u8ChannelSelBitwise, E_ADC_CLK_SRC ClockSrc, uint8_t u8AdcDivisor)
{
    /* reset ADC */
    SYS->IPRSTC2.ADC_RST = 1;
    SYS->IPRSTC2.ADC_RST = 0;
    
    /* ADC clock source */
    SYSCLK->CLKSEL1.ADC_S = ClockSrc;
    
    /* Set ADC divisor */
    SYSCLK->CLKDIV.ADC_N = u8AdcDivisor;
    /* ADC engine clock enable */
    SYSCLK->APBCLK.ADC_EN = 1;
    /* ADC enable */
    ADC->ADCR.ADEN = 1;
    
    if( InputMode == ADC_SINGLE_END )
        ADC->ADCR.DIFFEN = 0;     /* single end input */
    else
        ADC->ADCR.DIFFEN = 1;     /* differential input */
    
    if( OpMode == ADC_SINGLE_OP )
        ADC->ADCR.ADMD = 0;     /* single mode */
    else if( OpMode == ADC_BURST_OP )
        ADC->ADCR.ADMD = 1;     /* burst mode */
    else if( OpMode == ADC_SINGLE_CYCLE_OP )
        ADC->ADCR.ADMD = 2;     /* single-cycle scan mode */
    else
        ADC->ADCR.ADMD = 3;     /* continuous scan mode */
    
    ADC->ADCHER.CHEN = u8ChannelSelBitwise;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_Close                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the ADC function, ADC engine clock, ADC compare 0&1 and related interrupts.                  */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_Close(void)
{     
    ADC->ADCR.ADEN = 0;                /* ADC disable */
    SYSCLK->APBCLK.ADC_EN = 0;         /* ADC engine clock disable */
    ADC->ADCR.ADIE = 0;                /* Disable ADC interrupt */
    NVIC_DisableIRQ(ADC_IRQn);
    
    ADC->ADCMPR[0].CMPEN = 0;          /* Disable ADC compare 0 */
    ADC->ADCMPR[0].CMPIE = 0;          /* Disable ADC compare 0 interrupt */
    
    ADC->ADCMPR[1].CMPEN = 0;          /* Disable ADC compare 1 */
    ADC->ADCMPR[1].CMPIE = 0;          /* Disable ADC compare 1 interrupt */
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_SetADCChannel                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    u8ChannelSelBitwise [in]:  Specify the analog input channels.                                        */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Select ADC input channels.                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_SetADCChannel(uint8_t u8ChannelSelBitwise)
{     
    ADC->ADCHER.CHEN = u8ChannelSelBitwise;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_ConfigADCChannel7                                                                      */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*   Ch7Src [in]:  Specify the analog input source. It could be EXTERNAL_INPUT_SIGNAL / INTERNAL_BANDGAP.  */
/*                                                                                                         */
/* Returns:                                                                                                */
/*   None.                                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*   Select the input signal source of channel 7.                                                          */
/*   ADC channel 7 is a multi-function channel.                                                            */
/*   Its input source could come from a external signal or a internal bandgap voltage.                     */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_ConfigADCChannel7(E_ADC_CH7_SRC Ch7Src)
{
    ADC->ADCHER.PRESEL = Ch7Src;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_SetADCInputMode                                                                        */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    InputMode [in]:  Specify the input mode. It could be ADC_SINGLE_END / ADC_DIFFERENTIAL.              */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the ADC input mode.                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_SetADCInputMode(E_ADC_INPUT_MODE InputMode)
{
    if( InputMode == ADC_SINGLE_END )
        ADC->ADCR.DIFFEN = 0;     /* single end input */
    else
        ADC->ADCR.DIFFEN = 1;     /* differential input */
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_SetADCOperationMode                                                                    */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    OpMode [in]:  Specify the operation mode.                                                            */
/*                  It could be ADC_SINGLE_OP / ADC_BURST_OP / ADC_SINGLE_CYCLE_OP / ADC_CONTINUOUS_OP.    */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the ADC operation mode.                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_SetADCOperationMode(E_ADC_OPERATION_MODE OpMode)
{
    if( OpMode == ADC_SINGLE_OP )
        ADC->ADCR.ADMD = 0;         /* single mode */
    else if( OpMode == ADC_BURST_OP )
        ADC->ADCR.ADMD = 1;         /* burst mode */
    else if( OpMode == ADC_SINGLE_CYCLE_OP )
        ADC->ADCR.ADMD = 2;         /* single-cycle scan mode */
    else
        ADC->ADCR.ADMD = 3;         /* continuous scan mode */
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_SetADCClkSrc                                                                           */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    ClockSrc [in]:  Specify the ADC clock source.                                                        */
/*                    It could be EXTERNAL_12MHZ / INTERNAL_PLL / INTERNAL_RC22MHZ.                        */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the ADC clock source.                                                                            */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_SetADCClkSrc(E_ADC_CLK_SRC ClockSrc)
{
    SYSCLK->CLKSEL1.ADC_S = ClockSrc; /* ADC clock source */
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_SetADCDivisor                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    u8AdcDivisor [in]:  Specify the divisor value. It could be 0~255.                                    */
/*                        ADC clock frequency = ADC clock source frequency / ( u8AdcDivisor + 1 )          */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the divisor value of ADC clock.                                                                  */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_SetADCDivisor(uint8_t u8AdcDivisor)
{
    SYSCLK->CLKDIV.ADC_N = u8AdcDivisor;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_EnableADCInt                                                                           */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    Callback    [in]:  The callback function of ADC interrupt.                                           */
/*    u32UserData [in]:  This user's data will be passed to the callback function.                         */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Enable the ADC interrupt and setup callback function.                                                */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_EnableADCInt(DRVADC_ADC_CALLBACK Callback, uint32_t u32UserData)
{
    g_ptADCCallBack = Callback;
    g_pu32UserData[0] = u32UserData;
    _DRVADC_CLEAR_ADC_INT_FLAG();     /* clear the A/D interrupt flag for safe */
    ADC->ADCR.ADIE = 1;
    NVIC_SetPriority(ADC_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
    NVIC_EnableIRQ(ADC_IRQn);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_DisableADCInt                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the ADC interrupt.                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_DisableADCInt(void)
{
    ADC->ADCR.ADIE = 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_EnableADCCmp0Int                                                                       */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    Callback    [in]:  The callback function of ADC result monitor 0 (compare 0) interrupt.              */
/*    u32UserData [in]:  This user's data will be passed to the callback function.                         */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Enable the ADC compare 0 interrupt and setup callback function.                                      */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_EnableADCCmp0Int(DRVADC_ADCMP0_CALLBACK Callback, uint32_t u32UserData)
{
    g_ptADCMP0CallBack = Callback;
    g_pu32UserData[1] = u32UserData;
    _DRVADC_CLEAR_CMP0_INT_FLAG();        /* clear the ADC comparator 0 interrupt flag for safe */
    ADC->ADCMPR[0].CMPIE = 1;
    NVIC_SetPriority(ADC_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
    NVIC_EnableIRQ(ADC_IRQn);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_DisableADCCmp0Int                                                                      */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the ADC compare 0 interrupt.                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_DisableADCCmp0Int(void)
{
    ADC->ADCMPR[0].CMPIE = 0;
}

