wjw890912/si4432-m051/M051_SI4432_RELAY/Lib/DrvADC.c
    if(u16CmpData>0x0FFF)
        return E_DRVADC_ARGUMENT;
    
    if(u8CmpMatchCount>0x0F)
        return E_DRVADC_ARGUMENT;
    
    ADC->ADCMPR[0].CMPCH     = u8CmpChannelNum;
    ADC->ADCMPR[0].CMPCOND   = CmpCondition;
    ADC->ADCMPR[0].CMPD      = u16CmpData;
    ADC->ADCMPR[0].CMPMATCNT = u8CmpMatchCount;
    ADC->ADCMPR[0].CMPEN     = 1;
    
    return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_DisableADCCmp0                                                                         */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the ADC result monitor 0.                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_DisableADCCmp0(void)
{
    ADC->ADCMPR[0].CMPEN = 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_EnableADCCmp1                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    u8CmpChannelNum [in]:  Specify the channel number that want to compare.                              */
/*    CmpCondition    [in]:  Specify the compare condition.                                                */
/*                           LESS_THAN for the condition of "less than the compare data";                  */
/*                           GREATER_OR_EQUAL for the condition of "greater or equal to the compare data." */
/*    u16CmpData      [in]:  Specify the compare data.                                                     */
/*    u8CmpMatchCount [in]:  Specify the compare match count.                                              */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    E_DRVADC_ARGUMENT: one of the input arguments is out of the range.                                   */
/*    E_SUCCESS: the compare function is enabled.                                                          */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Enable the ADC result monitor 1 and configure the necessary settings.                                */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvADC_EnableADCCmp1(uint8_t u8CmpChannelNum, E_ADC_CMP_CONDITION CmpCondition, uint16_t u16CmpData, uint8_t u8CmpMatchCount)
{
    if(u8CmpChannelNum>7)
        return E_DRVADC_ARGUMENT;
    
    if(u16CmpData>0x0FFF)
        return E_DRVADC_ARGUMENT;
    
    if(u8CmpMatchCount>0x0F)
        return E_DRVADC_ARGUMENT;
    
    ADC->ADCMPR[1].CMPCH     = u8CmpChannelNum;
    ADC->ADCMPR[1].CMPCOND   = CmpCondition;
    ADC->ADCMPR[1].CMPD      = u16CmpData;
    ADC->ADCMPR[1].CMPMATCNT = u8CmpMatchCount;
    ADC->ADCMPR[1].CMPEN     = 1;
    
    return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_DisableADCCmp1                                                                         */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the ADC result monitor 1.                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_DisableADCCmp1(void)
{
    ADC->ADCMPR[1].CMPEN = 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_EnableSelfCalibration                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Enable the self calibration function.                                                                */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_EnableSelfCalibration(void)
{
    ADC->ADCALR.CALEN = 1;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_IsCalibrationDone                                                                      */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    TRUE:  the self calibration action is finished.                                                      */
/*    FALSE: the self calibration action is in progress.                                                   */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Check whether the self calibration action is finished or not.                                        */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvADC_IsCalibrationDone(void)
{
    if(ADC->ADCALR.CALDONE == 1)
        return TRUE;
    else
        return FALSE;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_DisableSelfCalibration                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the self calibration function.                                                               */
/*---------------------------------------------------------------------------------------------------------*/
void DrvADC_DisableSelfCalibration(void)
{
    ADC->ADCALR.CALEN = 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvADC_GetVersion                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    Version number.                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Get the version number of M05xx ADC driver.                                                          */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvADC_GetVersion (void)
{
    return DRVADC_VERSION_NUM;
}

